### Set up

In [96]:
import wrds

In [97]:
conn = wrds.Connection(wrds_username='qiqizhou77')

Loading library list...
Done

In [13]:
# Imoprt yahoo_fin
import pandas as pd
import yahoo_fin.stock_info as si

# Liquidity ratio

**Current Ratio**

In [39]:
# current_ratios quarterly -- q / yearly -- a
current_ratios = conn.raw_sql(
    """SELECT q.datadate, q.actq/q.lctq as current_ratio_q,
              a.act/a.lct as current_ratio_a
        FROM comp.g_fundq q
        JOIN comp.g_funda a
        ON a.gvkey = q.gvkey
        WHERE q.gvkey = '019349'
        AND q.datadate >= '2000-01-01'::date
        ORDER BY a.datadate
        """)
current_ratios

        datadate  current_ratio_q  current_ratio_a
0     2000-03-31        53.342581         4.129180
1     2000-09-30         2.237396         4.129180
2     2001-03-31         1.386260         4.129180
3     2001-09-30         1.145742         4.129180
4     2002-03-31              NaN         4.129180
...          ...              ...              ...
3323  2019-12-31         1.382680         1.552615
3324  2020-03-31         1.577812         1.552615
3325  2020-06-30         1.633536         1.552615
3326  2020-09-30         1.552615         1.552615
3327  2020-12-31         1.562913         1.552615

[3328 rows x 3 columns]

In [41]:
# current_ratios / yearly -- a
current_ratios = conn.raw_sql(
    """SELECT datadate, act/lct as current_ratio_a
        FROM comp.g_funda
        WHERE gvkey = '019349'
        AND datadate >= '2016-01-01'::date
        ORDER BY datadate
        """)
current_ratios

     datadate  current_ratio_a
0  2016-09-30         1.289239
1  2017-09-30         1.346476
2  2018-09-30         1.348749
3  2019-09-30         1.387339
4  2020-09-30         1.552615

**Quick Ratio**

In [44]:
# quick_ratio / yearly -- a
quick_ratio = conn.raw_sql("""SELECT datadate, (act - invt)/lct as quick_ratio_a
                            FROM comp.g_funda
                            WHERE gvkey = '019349'
                            AND datadate >= '2016-01-01'::date""")
quick_ratio

     datadate  quick_ratio_a
0  2016-09-30       0.866087
1  2017-09-30       0.886920
2  2018-09-30       1.058717
3  2019-09-30       1.095440
4  2020-09-30       1.324129

**Cash Ratio**

In [68]:
# cash_ratio / yearly -- a
cash_ratio = conn.raw_sql("""SELECT datadate, chee/lct as cash_ratio_a
                            FROM comp.g_funda
                            WHERE gvkey = '019349'
                            AND datadate >= '2016-01-01'::date""")
cash_ratio

     datadate  cash_ratio_a
0  2016-09-30      0.247414
1  2017-09-30      0.193322
2  2018-09-30      0.231148
3  2019-09-30      0.244288
4  2020-09-30      0.411947

**Operating cash flow ratio**

In [52]:
# Operating_cf / yearly -- a
operating_cf = conn.raw_sql("""SELECT datadate, oancf/lct as Operating_cf_ratio_a
                                FROM comp.g_funda
                                WHERE gvkey = '019349'
                                AND datadate >= '2016-01-01'::date""")
operating_cf

     datadate  operating_cf_ratio_a
0  2016-09-30              0.177346
1  2017-09-30              0.165368
2  2018-09-30              0.175983
3  2019-09-30              0.166709
4  2020-09-30              0.259761

# Leverage Ratios

**Debt to equity**

In [58]:
# debt_to_equity / yearly -- a
de_ratio = conn.raw_sql("""SELECT datadate, (dlc + dltt)/ceq as de_ratio_a
                                FROM comp.g_funda
                                WHERE gvkey = '019349'
                                AND datadate >= '2016-01-01'::date""")
de_ratio

     datadate  de_ratio_a
0  2016-09-30    0.889447
1  2017-09-30    0.723696
2  2018-09-30    0.669698
3  2019-09-30    0.714905
4  2020-09-30    1.119127

**Debt to asset**

In [60]:
# debt_to_asset/ yearly -- a
da_ratio = conn.raw_sql("""SELECT datadate, (dltt+dlc)/at as da_ratio_a

                            FROM comp.g_funda
                            WHERE gvkey = '019349'
                            AND datadate >= '2016-01-01'::date""")
da_ratio

     datadate  da_ratio_y
0  2016-09-30    0.246323
1  2017-09-30    0.240830
2  2018-09-30    0.231631
3  2019-09-30    0.242586
4  2020-09-30    0.359710

**Debt to EBITDA**

In [62]:
# debt_to_ebitda/ yearly -- a
d_ebita = conn.raw_sql("""SELECT datadate, (dltt+dlc)/(ebitda) as d_ebitda_a
                            FROM comp.g_funda
                            WHERE gvkey = '019349'
                            AND datadate >= '2016-01-01'::date""")
d_ebita

     datadate  d_ebitda_a
0  2016-09-30    3.187545
1  2017-09-30    3.113129
2  2018-09-30    3.521230
3  2019-09-30    3.669754
4  2020-09-30    5.929617

**Net Debt to EBITDA**

In [65]:
# net_debt_to_ebitda/ yearly -- a
net_d_ebitda = conn.raw_sql("""SELECT datadate, (dlttchee)/(ebitda) as net_d_ebitda_a
                                FROM comp.g_funda
                                WHERE gvkey = '019349'
                                AND datadate >= '2016-01-01'::date""")
net_d_ebitda

     datadate  net_d_ebitda_a
0  2016-09-30        2.094596
1  2017-09-30        2.302676
2  2018-09-30        2.310243
3  2019-09-30        2.422171
4  2020-09-30        4.059739

**Interest Coverage Ratio**

In [69]:
# int_cov/ yearly -- a
int_cov = conn.raw_sql("""SELECT datadate, ebitda/xint as int_coverage_a
                            FROM comp.g_funda
                            WHERE gvkey = '019349'
                            AND datadate >= '2016-01-01'::date""")
int_cov

     datadate  int_coverage_a
0  2016-09-30        9.823054
1  2017-09-30        9.848716
2  2018-09-30        8.620755
3  2019-09-30        6.424321
4  2020-09-30       10.381215

**Debt to Total Capitalization**

In [12]:
# d_total_cap/ yearly -- a
d_total_cap = conn.raw_sql("""SELECT datadate, (dltt+dlc)/(dltt+dlc+teq) as d_total_cap_a
                                FROM comp.g_funda
                                WHERE gvkey = '019349'
                                AND datadate >= '2016-01-01'::date""")
d_total_cap

     datadate  d_total_cap_a
0  2016-09-30       0.470745
1  2017-09-30       0.419851
2  2018-09-30       0.401089
3  2019-09-30       0.416877
4  2020-09-30       0.528108

# Efficiency Ratios

**Inventory Turnover**

In [74]:
# invt_turnover/ yearly -- a
invt_turnover = conn.raw_sql("""SELECT datadate, cogs/invt as invt_turnover_a
                                    FROM comp.g_funda
                                    WHERE gvkey = '019349'
                                    AND datadate >= '2016-01-01'::date""")
invt_turnover

     datadate  invt_turnover_a
0  2016-09-30         2.932379
1  2017-09-30         2.758650
2  2018-09-30         3.957868
3  2019-09-30         3.895853
4  2020-09-30         4.360616

**Fixed Assets Turnover**

In [75]:
# f_asset_turnover/ yearly -- a
f_asset_turnover = conn.raw_sql("""SELECT datadate, revt/ppegt as f_asset_turnover_a
                                    FROM comp.g_funda
                                    WHERE gvkey = '019349'
                                    AND datadate >= '2016-01-01'::date""")
f_asset_turnover

     datadate  f_asset_turnover_a
0  2016-09-30            3.111823
1  2017-09-30            3.089735
2  2018-09-30            2.975528
3  2019-09-30            2.912344
4  2020-09-30            2.447486

**Total Assets Turnover**

In [76]:
# t_asset_turnover/ yearly -- a
t_asset_turnover = conn.raw_sql("""SELECT datadate, revt/at as t_asset_turnover_a
                                    FROM comp.g_funda
                                    WHERE gvkey = '019349'
                                    AND datadate >= '2016-01-01'::date""")
t_asset_turnover

     datadate  t_asset_turnover_a
0  2016-09-30            0.633518
1  2017-09-30            0.620677
2  2018-09-30            0.597804
3  2019-09-30            0.578038
4  2020-09-30            0.461181

**Working Capital Turnover**

~~~
working_cap_turnover = conn.raw_sql("""SELECT datadate, 
                                              sale/(act-lct) as working_cap_turnover_a
                                       FROM comp.g_funda
                                       WHERE gvkey = '019349'
                                       AND datadate >= '2016-01-01'::date""")
working_cap_turnover
~~~

# Profitability Ratios

**Gross Profit Margin**

In [78]:
# gross_profit/ yearly -- a
gross_profit = conn.raw_sql("""SELECT datadate, (revt-cogs)/revt as gross_profit_a
                                    FROM comp.g_funda
                                    WHERE gvkey = '019349'
                                    AND datadate >= '2016-01-01'::date""")
gross_profit

     datadate  gross_profit_a
0  2016-09-30        0.331375
1  2017-09-30        0.337584
2  2018-09-30        0.338242
3  2019-09-30        0.335836
4  2020-09-30        0.405117

**Operating Margin**

In [79]:
# operating_margin/ yearly -- a
operating_margin = conn.raw_sql("""SELECT datadate, ebit/revt as operating_margin_a
                                    FROM comp.g_funda
                                    WHERE gvkey = '019349'
                                    AND datadate >= '2016-01-01'::date""")
operating_margin

     datadate  operating_margin_a
0  2016-09-30            0.089661
1  2017-09-30            0.088418
2  2018-09-30            0.071191
3  2019-09-30            0.077053
4  2020-09-30            0.079700

**ROA**

In [81]:
# roa/ yearly -- a
roa = conn.raw_sql("""SELECT datadate, nicon/at as roa_a
                        FROM comp.g_funda
                        WHERE gvkey = '019349'
                        AND datadate >= '2016-01-01'::date""")
roa

     datadate     roa_a
0  2016-09-30  0.041856
1  2017-09-30  0.044789
2  2018-09-30  0.040910
3  2019-09-30  0.034416
4  2020-09-30  0.033253

**ROE**

In [82]:
# roa/ yearly -- a
roe = conn.raw_sql("""SELECT datadate, nicon/ceq as roe_a
                        FROM comp.g_funda
                        WHERE gvkey = '019349'
                        AND datadate >= '2016-01-01'::date""")
roe

     datadate     roe_a
0  2016-09-30  0.151137
1  2017-09-30  0.134592
2  2018-09-30  0.118280
3  2019-09-30  0.101426
4  2020-09-30  0.103458

**Net Profit Margin**

In [83]:
# net_profit / yearly -- a
net_profit = conn.raw_sql("""SELECT datadate, nicon/revt as net_profit_a
                        FROM comp.g_funda
                        WHERE gvkey = '019349'
                        AND datadate >= '2016-01-01'::date""")
net_profit

     datadate  net_profit_a
0  2016-09-30      0.066069
1  2017-09-30      0.072162
2  2018-09-30      0.068434
3  2019-09-30      0.059540
4  2020-09-30      0.072105

**EBITDA Margin**

In [84]:
# ebitda / yearly -- a
ebitda = conn.raw_sql("""SELECT datadate, ebitda/revt as ebitda_a
                        FROM comp.g_funda
                        WHERE gvkey = '019349'
                        AND datadate >= '2016-01-01'::date""")
ebitda

     datadate  ebitda_a
0  2016-09-30  0.121980
1  2017-09-30  0.124637
2  2018-09-30  0.110038
3  2019-09-30  0.114359
4  2020-09-30  0.131539

**Pre-tax earnings margin**

In [5]:
pre_tax_earning_margin = conn.raw_sql("""SELECT datadate, pi/revt as pre_tax_earning_margin
                                         FROM comp.g_funda
                                         WHERE gvkey = '019349'
                                         AND datadate >= '2016-01-01'::date""")
pre_tax_earning_margin

     datadate  pre_tax_earning_margin
0  2016-09-30                0.092964
1  2017-09-30                0.100013
2  2018-09-30                0.096937
3  2019-09-30                0.086553
4  2020-09-30                0.099267

# Market Value Ratios

**Book value per share**

In [86]:
# bvps / yearly -- a
bvps = conn.raw_sql("""SELECT datadate, ceq/cshpria as bvps_a
                        FROM comp.g_funda
                        WHERE gvkey = '019349'
                        AND datadate >= '2016-01-01'::date""")
bvps

     datadate     bvps_a
0  2016-09-30  42.304430
1  2017-09-30  53.053510
2  2018-09-30  55.792006
3  2019-09-30  59.614282
4  2020-09-30  45.130126

**EPS**

In [98]:
# eps / yearly -- a
eps = conn.raw_sql("""SELECT datadate, nicon/cshpria as eps_a
                        FROM comp.g_funda
                        WHERE gvkey = '019349'
                        AND datadate >= '2016-01-01'::date""")
eps

     datadate     eps_a
0  2016-09-30  6.506852
1  2017-09-30  7.378906
2  2018-09-30  6.972467
3  2019-09-30  6.405516
4  2020-09-30  5.109539

**P/E -- using wrds**

In [144]:
def pe_ratio():
    
    eps = conn.raw_sql("""SELECT datadate, 
                             nicon/cshpria as eps_a,
                             DATE_TRUNC('month',datadate) as month
                        FROM comp.g_funda
                        WHERE gvkey = '019349'
                        AND datadate >= '2016-01-01'::date""")
    eps = eps.astype({"month":object})
    
    price = conn.raw_sql("""SELECT prccd/ajexdi as adj_close,
                               DATE_TRUNC('month',datadate) as month
                     FROM comp.g_sec_dprc 
                     WHERE gvkey = '019349'
                     AND datadate >= '2016-01-01'
                     ORDER by datadate
                     """)
    # get the last price of each month
    price = price.groupby('month').tail(1)
    
    df = pd.merge(eps, price, on='month')
    
    df['P/E'] = df['adj_close'] /df['eps_a']
    
    df = df[['datadate','P/E']]
    
    return df

In [145]:
pe_ratio()

     datadate        P/E
0  2016-09-30  17.258730
1  2017-09-30  18.444468
2  2018-09-30  15.830838
3  2019-09-30  15.338343
4  2020-09-30  21.113451

**P/E -- using yahoo** as  reference

In [14]:
quote = si.get_quote_table("SIE.DE")
quote["PE Ratio (TTM)"]

24.64

**P/Cash Flow**

In [15]:
cash_flow = conn.raw_sql("""SELECT datadate, (fincf+ivncf+oancf) as cash_flow
                        FROM comp.g_funda
                        WHERE gvkey = '019349'
                        AND datadate >= '2016-01-01'::date""")
cash_flow

     datadate  cash_flow
0  2016-09-30      757.0
1  2017-09-30    -1841.0
2  2018-09-30     2705.0
3  2019-09-30     1168.0
4  2020-09-30     6850.0

In [146]:
def P_CF_ratio     ():
    
    cash_flow = conn.raw_sql("""SELECT datadate, 
                                       (fincf+ivncf+oancf) as cash_flow,
                                       DATE_TRUNC('month',datadate) as month
                                FROM comp.g_funda
                                WHERE gvkey = '019349'
                                AND datadate >= '2016-01-01'::date""")
    cash_flow = cash_flow.astype({"month":object})
    
    price = conn.raw_sql("""SELECT prccd/ajexdi as adj_close,
                               DATE_TRUNC('month',datadate) as month
                            FROM comp.g_sec_dprc 
                            WHERE gvkey = '019349'
                            AND datadate >= '2016-01-01'
                            ORDER by datadate
                     """)
    # get the last price of each month
    price = price.groupby('month').tail(1)
    
    df = pd.merge(cash_flow, price, on='month')
    
    df['P/CF'] = df['adj_close'] /df['cash_flow']
    
    df = df[['datadate','P/CF']]
    
    return df

In [147]:
P_CF_ratio()

     datadate      P/CF
0  2016-09-30  0.148349
1  2017-09-30 -0.073927
2  2018-09-30  0.040806
3  2019-09-30  0.084118
4  2020-09-30  0.015749

**PEG  = (Price/EPS)/EPS Growth Rate**

In [186]:
# retrieve eps one year more
def EPS_growth_rate():
    
    eps = conn.raw_sql("""SELECT datadate, nicon/cshpria as eps_a
                        FROM comp.g_funda
                        WHERE gvkey = '019349'
                        AND datadate >= '2015-01-01'::date""")
    
    eps['change'] = eps['eps_a'] - eps['eps_a'].shift(1)
    eps['growth'] = eps['change']/eps['eps_a'].shift(1)
    
    return eps['growth'][1:].values

In [190]:
def peg_ratio():
 
    eps = conn.raw_sql("""SELECT datadate, 
                             nicon/cshpria as eps_a,
                             DATE_TRUNC('month',datadate) as month
                        FROM comp.g_funda
                        WHERE gvkey = '019349'
                        AND datadate >= '2016-01-01'::date""")
    eps = eps.astype({"month":object})
    
    price = conn.raw_sql("""SELECT prccd/ajexdi as adj_close,
                               DATE_TRUNC('month',datadate) as month
                     FROM comp.g_sec_dprc 
                     WHERE gvkey = '019349'
                     AND datadate >= '2016-01-01'
                     ORDER by datadate
                     """)
    
    # get the last price of each month
    price = price.groupby('month').tail(1)
    df = pd.merge(eps, price, on='month')
    df['P/E'] = df['adj_close'] /df['eps_a']
    
    df_growth = EPS_growth_rate()
    df['PEG'] = df['P/E'].values / df_growth
    return df[['datadate','PEG']]

In [191]:
peg_ratio()

     datadate         PEG
0  2016-09-30  848.602913
1  2017-09-30  137.623795
2  2018-09-30 -287.409111
3  2019-09-30 -188.633649
4  2020-09-30 -104.355668

# Others

**Risk size**

In [37]:
risk_size = conn.raw_sql("""SELECT datadate, at as reasearch_sales_a
                                  FROM comp.g_funda
                                  WHERE gvkey = '019349'
                                  AND datadate >= '2016-01-01'::date""")
risk_size

     datadate  reasearch_sales_a
0  2016-09-30           125717.0
1  2017-09-30           133804.0
2  2018-09-30           138915.0
3  2019-09-30           150248.0
4  2020-09-30           123897.0

**ROIC**

In [7]:
roic = conn.raw_sql("""SELECT datadate, 
                       ebit*(1-txt/pi)/icapt as roic
                       FROM comp.g_funda
                       WHERE gvkey = '019349'
                       AND datadate >= '2016-01-01'::date""")
roic

     datadate      roic
0  2016-09-30  0.087355
1  2017-09-30  0.075953
2  2018-09-30  0.058583
3  2019-09-30  0.061740
4  2020-09-30  0.044257

**Projected NOPAT Growth**

= roic * IR = icapt change / icapt

In [8]:
# inv_cap -- invested capital
# Retrive one more year than the others
def projected_nopat_growth():
    
    inv_cap = conn.raw_sql("""SELECT datadate, 
                       icapt as inv_cap 
                       FROM comp.g_funda
                       WHERE gvkey = '019349'
                       AND datadate >= '2015-01-01'::date""")
    
    inv_cap['change'] = inv_cap['inv_cap']-inv_cap['inv_cap'].shift(1)
    inv_cap['growth'] = inv_cap['change'] / inv_cap['inv_cap']
    
    return inv_cap[['datadate','growth']][1:]

In [9]:
projected_nopat_growth()

     datadate    growth
1  2016-09-30 -0.036256
2  2017-09-30  0.164465
3  2018-09-30  0.051392
4  2019-09-30  0.076538
5  2020-09-30 -0.045858

**R&D expense / Sales**

In [30]:
reasearch_sales = conn.raw_sql("""SELECT datadate, xrd/revt as reasearch_sales_a
                                  FROM comp.g_funda
                                  WHERE gvkey = '019349'
                                  AND datadate >= '2016-01-01'::date""")
reasearch_sales

     datadate  reasearch_sales_a
0  2016-09-30           0.061787
1  2017-09-30           0.064624
2  2018-09-30           0.069252
3  2019-09-30           0.068210
4  2020-09-30           0.083936

**R&D expense / Operating Expense**

In [34]:
reasearch_expense = conn.raw_sql("""SELECT datadate, xrd/xopr as reasearch_expense_a
                                  FROM comp.g_funda
                                  WHERE gvkey = '019349'
                                  AND datadate >= '2016-01-01'::date""")
reasearch_expense

     datadate  reasearch_expense_a
0  2016-09-30             0.070371
1  2017-09-30             0.073826
2  2018-09-30             0.077815
3  2019-09-30             0.077018
4  2020-09-30             0.096649

**Analysts recommendation std**

In [50]:
# reconmendation_std
rec_std = conn.raw_sql("""SELECT statpers as date,
                                 stdev as rec_std
                             FROM ibes.recdsum
                             WHERE ticker = 'IBM'
                             AND statpers >='2016-01-01'::date""")
rec_std.head()

         date  rec_std
0  2016-01-14     0.91
1  2016-02-18     0.91
2  2016-03-17     0.91
3  2016-04-14     0.91
4  2016-05-19     0.91

**Analysts coverage**

In [51]:
coverage = conn.raw_sql("""SELECT statpers as date,
                                  numrec as coverage
                             FROM ibes.recdsum
                             WHERE ticker = 'IBM'
                             AND statpers >='2016-01-01'::date""")
coverage.head()

         date  coverage
0  2016-01-14      24.0
1  2016-02-18      25.0
2  2016-03-17      25.0
3  2016-04-14      26.0
4  2016-05-19      26.0

**Analysts Buy percent**

In [53]:
buy_pct = conn.raw_sql("""SELECT statpers as date,
                                  buypct as buy_pct
                             FROM ibes.recdsum
                             WHERE ticker = 'IBM'
                             AND statpers >='2016-01-01'::date""")
buy_pct.head()

         date  buy_pct
0  2016-01-14    20.83
1  2016-02-18    24.00
2  2016-03-17    24.00
3  2016-04-14    26.92
4  2016-05-19    26.92

**Analyst Sell Percent**

In [54]:
sell_pct = conn.raw_sql("""SELECT statpers as date,
                                 sellpct as sell_pct
                             FROM ibes.recdsum
                             WHERE ticker = 'IBM'
                             AND statpers >='2016-01-01'::date""")
sell_pct.head()

         date  sell_pct
0  2016-01-14     20.83
1  2016-02-18     20.00
2  2016-03-17     20.00
3  2016-04-14     19.23
4  2016-05-19     19.23

**Analyst Hold Percent**

In [55]:
hold_pct = conn.raw_sql("""SELECT statpers as date,
                                  holdpct as hold_pct
                             FROM ibes.recdsum
                             WHERE ticker = 'IBM'
                             AND statpers >='2016-01-01'::date""")
hold_pct.head()

         date  hold_pct
0  2016-01-14     58.33
1  2016-02-18     56.00
2  2016-03-17     56.00
3  2016-04-14     53.85
4  2016-05-19     53.85

In [193]:
conn.close()